cask_args appdir: '/Applications'

tap 'dbcli/tap'
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'ibm-swift/kitura'
tap 'jesseduffield/lazydocker'
tap 'kylef/formulae'
tap 'mongodb/brew'

brew 'adns'
brew 'autojump'
brew 'circleci'
brew 'cmake'
brew 'ctls'
brew 'gdbm'
brew 'gettext'
brew 'glances'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'heroku'
brew 'heroku-node'
brew 'icu4c'
brew 'jq'
brew 'kitura'
brew 'kotlin'
brew 'lazydocker'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libressl'
brew 'libtasn1'
brew 'libunistring'
brew 'libusb'
brew 'libyaml'
brew 'magic-wormhole'
brew 'mint'
brew 'nasm'
brew 'ncurses'
brew 'nettle'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'openssl'
brew 'p11-kit'
brew 'pgcli'
brew 'pinentry'
brew 'pkg-config'
brew 'python'
brew 'python@2'
brew 'readline'
brew 'ruby'
brew 'speedtest-cli'
brew 'sphinx-doc'
brew 'sqlite'
brew 'swiftenv'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'vim'
brew 'wget'
brew 'xcodegen'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'aerial'
cask 'brave-browser'
cask 'docker'
cask 'firefox-developer-edition'
cask 'intel-power-gadget'
cask 'iterm2'
cask 'postman'
cask 'vscodium'
